In [1]:
import numpy as np
import pandas as pd
dict = {'x':10,'y':20}
pd.Series(dict)

x    10
y    20
dtype: int64

In [4]:
import pandas as pd
people_dict={"first":["Richard", "Robert", "Jason"],
             "last" :["Stone", "Deepdive", "Seaborn"],
             "email": ["richardstone@email.com", "robertdeepdive@email.com", 
                        "jasonseaborn@email.com"]}
df=pd.DataFrame(people_dict)
df

     first      last                     email
0  Richard     Stone    richardstone@email.com
1   Robert  Deepdive  robertdeepdive@email.com
2    Jason   Seaborn    jasonseaborn@email.com

In [7]:
df['last']

0       Stone
1    Deepdive
2     Seaborn
Name: last, dtype: object

In [26]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', 'blue', 'yellow', 'pink', 'black', 'green', 'red']
})

data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [27]:
data[['city','age']]

      city  age
0  Gurgaon   10
1    Delhi   22
2   Mumbai   13
3    Delhi   21
4   Mumbai   12
5    Delhi   11
6   Mumbai   17

In [28]:
data.drop(3)

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [19]:
data.dropna

<bound method DataFrame.dropna of    age section gender favourite_color
0   10       A      M             red
1   22       B      F            blue
2   13       C      F          yellow
3   21       B      M            pink
4   12       B      M           black
5   11       A      M           green
6   17       A      F             red>

In [30]:
data.loc[2]

age                    13
section                 C
city               Mumbai
gender                  F
favourite_color    yellow
Name: 2, dtype: object

In [36]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', 'blue', 'yellow', 'pink', 'black', 'green', 'red']
})

data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [37]:
data[data["age"]>=21]

   age section   city gender favourite_color
1   22       B  Delhi      F            blue
3   21       B  Delhi      M            pink

In [38]:
data['new'] = data['city'].str[:2]

In [ ]:
age	section	city	gender	favourite_color	new
0	10	A	Gurgaon	M	red	        Gu
1	22	B	Delhi	F	blue	        De
2	13	C	Mumbai	F	yellow	        Mu
3	21	B	Delhi	M	pink	        De
4	12	B	Mumbai	M	black	        Mu
5	11	A	Delhi	M	green	        De
6	17	A	Mumbai	F	red	        Mu

In [39]:
data.set_index('section', inplace=True)

In [ ]:
age	city	gender	favourite_color
section				
A	10	Gurgaon	M	red
B	22	Delhi	F	blue
C	13	Mumbai	F	yellow
D	21	Delhi	M	pink
E	12	Mumbai	M	black
F	11	Delhi	M	green
G	17	Mumbai	F	red

In [40]:
x = [1, 2, 3]
y = [4, 5, 6]
zipped = zip(x, y)
list(zipped)

[(1, 4), (2, 5), (3, 6)]

In [41]:
import pandas as pd
people_dict={"first":["Richard", "Robert", "Jason"],
             "last" :["Stone", "Deepdive", "Seaborn"],
             "email": ["richardstone@email.com", "robertdeepdive@email.com", 
                        "jasonseaborn@email.com"]}
df=pd.DataFrame(people_dict)
df

     first      last                     email
0  Richard     Stone    richardstone@email.com
1   Robert  Deepdive  robertdeepdive@email.com
2    Jason   Seaborn    jasonseaborn@email.com

In [43]:
df.iloc[1,2]

'robertdeepdive@email.com'

In [44]:
outside = ['A1','A1','A1','A2','A2','A2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
np.random.seed(101)
data = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['X','Y'])
data

             X         Y
A1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
A2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [45]:
data.loc['A1']

          X         Y
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [46]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', 'blue', 'yellow', 'pink', 'black', 'green', 'red']
})

data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [78]:
data.iloc[3:4, 0:3]

   age section   city
3   21       B  Delhi

In [80]:
data.iloc[3:5, 1:2]

  section
3       B
4       B

In [48]:
data["city"]

0    Gurgaon
1      Delhi
2     Mumbai
3      Delhi
4     Mumbai
5      Delhi
6     Mumbai
Name: city, dtype: object

In [60]:
data.iloc[[4,5], [2,3]]

     city gender
4  Mumbai      M
5   Delhi      M

In [67]:
data.iloc[[4,5], [2,3]]

     city gender
4  Mumbai      M
5   Delhi      M

In [58]:
data.iloc[3:5, 1:2]

  section
3       B
4       B

In [69]:
data.iloc[3:4, 0:3]

   age section   city
3   21       B  Delhi

In [76]:
data.iloc[2:4, 2:3]

     city
2  Mumbai
3   Delhi

In [49]:
data.drop(6)

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F            blue
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M            pink
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green

In [51]:
data.iloc[4]

age                    12
section                 B
city               Mumbai
gender                  M
favourite_color     black
Name: 4, dtype: object